Repository: viana-dener/VianaSoft.BuildingBlocks.Repo
Catalog: src/VianaSoft.BuildingBlocks.Core/Resources/LanguageResource.*.resx
Languages: es_es, fr_fr, pt_br

# ME00000001 TheResourceExists
source: The resource you are trying to create already exists.
es_es: El recurso que estás intentando crear ya existe.
fr_fr: La ressource que vous essayez de créer existe déjà.
pt_br: O recurso que você está tentando criar já existe.

# ME00000002 InvalidAuthentication
source: Invalid credentials. Please check your username and password.
es_es: Credenciales no válidas. Por favor verifique su nombre de usuario y contraseña.
fr_fr: Les informations d'identification invalides. Veuillez vérifier votre nom d'utilisateur et votre mot de passe.
pt_br: Credenciais inválidas. Por favor, verifique seu nome de usuário e senha.

# ME00000003 InvalidAuthorization
source: Access denied. You do not have sufficient permissions to access this feature.
es_es: Acceso denegado. No tiene permisos suficientes para acceder a esta función.
fr_fr: Accès refusé. Vous ne disposez pas des autorisations suffisantes pour accéder à cette fonctionnalité.
pt_br: Acesso negado. Você não possui permissões suficientes para acessar este recurso.

# ME00000004 PasswordsDontMatch
source: Passwords don't match
es_es: Las contraseñas no coinciden
fr_fr: Les mots de passe ne correspondent pas
pt_br: As senhas não correspondem.

# ME00000005 ConfirmPassword
source: Passwords don't match.
es_es: Las contraseñas no coinciden.
fr_fr: Les mots de passe ne correspondent pas.
pt_br: As senhas não correspondem.

# ME00000006 InvalidEmail
source: Invalid email format. Please enter a valid email address.
es_es: Formato de correo inválido. Por favor, introduce una dirección de correo electrónico válida.
fr_fr: Format d'email invalide. S'il vous plaît, mettez une adresse email valide.
pt_br: Formato de e-mail inválido. Por favor, insira um endereço de e-mail válido.

# ME00000007 InvalidNumericalValue
source: Invalid numerical value. Please enter a valid number.
es_es: Valor numérico no válido. Por favor ingrese un número valido.
fr_fr: Valeur numérique invalide. S'il vous plait, entrez un nombre valide.
pt_br: Valor numérico inválido. Por favor, insira um número válido.

# ME00000008 InvalidPassword
source: User or password are incorrect.
es_es: El usuario o la contraseña son incorrectos.
fr_fr: L'utilisateur ou le mot de passe sont incorrects.
pt_br: Usuário ou senha estão incorretos.

# ME00000009 IsLockedOut
source: User temporarily blocked for invalid attempts
es_es: Usuario bloqueado temporalmente por intentos no válidos
fr_fr: Utilisateur temporairement bloqué pour tentatives non valides
pt_br: Usuário bloqueado temporariamente por tentativas inválidas.

# ME00000010 IsNotAllowed
source: User is not allowed to login.
es_es: El usuario no tiene permitido iniciar sesión.
fr_fr: L'utilisateur n'est pas autorisé à se connecter.
pt_br: O usuário não tem permissão para fazer login.

# ME00000011 MinValueCharacters
source: The minimum allowed value is {0} characters.
es_es: El valor mínimo permitido es de {0} caracteres.
fr_fr: La valeur minimale autorisée est de {0} caractères.
pt_br: O valor mínimo permitido é de {0} caracteres.

# ME00000012 NotFound
source: Register not found.
es_es: Registro no encontrado.
fr_fr: Enregistrement non trouvé.
pt_br: Registro não encontrado.

# ME00000013 Required
source: Field {0} is mandatory.
es_es: El campo {0} es obligatorio.
fr_fr: Le champ {0} est obligatoire.
pt_br: O campo {0} é obrigatório.

# ME00000014 RequiredFields
source: Required fields not filled in. Please fill in all required fields.
es_es: Campos obligatorios no completados. Por favor, complete todos los campos obligatorios.
fr_fr: Champs obligatoires non remplis. Veuillez remplir tous les champs obligatoires.
pt_br: Campos obrigatórios não preenchidos. Por favor, preencha todos os campos obrigatórios.

# ME00000015 TwoFactor
source: User is required to confirm login in their second authentication factor.
es_es: Se requiere que el usuario confirme el inicio de sesión en su segundo factor de autenticación.
fr_fr: L'utilisateur doit confirmer la connexion dans son deuxième facteur d'authentification.
pt_br: O usuário precisa confirmar o login no segundo fator de autenticação.

# ME00000016 UpdateFailed
source: Update failed. Try again later.
es_es: La actualización falló. Intente nuevamente más tarde.
fr_fr: La mise à jour a échoué. Veuillez réessayer ultérieurement.
pt_br: A atualização falhou. Tente novamente mais tarde.

# ME00000017 InvalidToken
source: Sorry, the password recovery link has expired or is not valid. For security reasons, recovery links have a limited lifespan. We recommend starting the password recovery process again to get a new valid link.
es_es: Lo sentimos, el enlace de recuperación de contraseña ha caducado o no es válido. Por razones de seguridad, los enlaces de recuperación tienen un tiempo de vida limitado. Recomendamos comenzar nuevamente el proceso de recuperación de contraseña para obtener un nuevo enlace válido.
fr_fr: Désolé, le lien de récupération du mot de passe a expiré ou n'est pas valide. Pour des raisons de sécurité, les liens de récupération ont une durée de vie limitée. Nous vous recommandons de recommencer le processus de récupération du mot de passe pour obtenir un nouveau lien valide.
pt_br: Desculpe, o link de recuperação de senha expirou ou não é válido. Por razões de segurança, os links de recuperação têm um tempo de vida limitado. Recomendamos iniciar novamente o processo de recuperação de senha para obter um novo link válido.

# ME00000018 PasswordRequiresNonAlphanumeric
source: Passwords must have at least one special letter
es_es: Las contraseñas deben tener al menos una letra especial.
fr_fr: Les mots de passe doivent contenir au moins une lettre spéciale.
pt_br: As senhas devem ter pelo menos uma letra especial.

# ME00000019 PasswordRequiresUpper
source: Passwords must have at least one capital letter between A and Z.
es_es: Las contraseñas deben tener al menos una letra mayúscula entre A y Z.
fr_fr: Les mots de passe doivent contenir au moins une lettre majuscule entre A et Z.
pt_br: As senhas devem ter pelo menos uma letra maiúscula entre A e Z.

# ME00000020 PasswordRequiresLower
source: Passwords must have at least one lowercase letter between a and z.
es_es: Las contraseñas deben tener al menos una letra minúscula entre a y z.
fr_fr: Les mots de passe doivent contenir au moins une lettre minuscule entre a et z.
pt_br: As senhas devem ter pelo menos uma letra minúscula entre a e z.

# ME00000021 PasswordRequiresDigit
source: Passwords must have at least one number between 0 and 9.
es_es: Las contraseñas deben tener al menos un número entre 0 y 9.
fr_fr: Les mots de passe doivent contenir au moins un chiffre entre 0 et 9.
pt_br: As senhas devem ter pelo menos um número entre 0 e 9.

# ME00000022 ForgotEmailInvalid
source: An email with instructions for resetting your password has been sent, if the email address provided is associated with a valid account. Please check your inbox and follow the instructions provided. If you don't receive the email, check your spam folder or contact support.
es_es: Se ha enviado un correo electrónico con instrucciones para restablecer su contraseña, si la dirección de correo electrónico proporcionada está asociada a una cuenta válida. Por favor, revise su bandeja de entrada y siga las instrucciones proporcionadas. Si no recibe el correo electrónico, revise su carpeta de spam o comuníquese con el soporte.
fr_fr: Un email avec des instructions pour réinitialiser votre mot de passe a été envoyé, si l'adresse email fournie est associée à un compte valide. Veuillez vérifier votre boîte de réception et suivre les instructions fournies. Si vous ne recevez pas l'email, vérifiez votre dossier de spam ou contactez le support.
pt_br: Um email com instruções para redefinir sua senha foi enviado, caso o endereço de email fornecido esteja associado a uma conta válida. Por favor, verifique sua caixa de entrada e siga as instruções fornecidas. Se você não receber o email, verifique sua pasta de spam ou entre em contato com o suporte.

# ME00000023 RequestSuccessfullyReceivedController
source: Request successfully received at the controller.
es_es: Solicitud recibida correctamente por el controlador.
fr_fr: Demande reçue avec succès par le contrôleur.
pt_br: Requisição recebida com sucesso no controlador.

# ME00000024 RequestSuccessfullyReceivedOrchestrator
source: Request received successfully in the orchestrator.
es_es: Solicitud recibida correctamente en el orquestador.
fr_fr: Demande reçue avec succès dans l'orchestrateur.
pt_br: Requisição recebida com sucesso no orquestrador.

# ME00000025 RequestSuccessfullyReceivedDomain
source: Request received successfully on the domain.
es_es: Solicitud recibida correctamente en el dominio.
fr_fr: Demande reçue avec succès sur le domaine.
pt_br: Requisição recebida com sucesso no domínio.

# ME00000026 RequestSuccessfullyReceivedRepository
source: Request successfully received in the repository.
es_es: Solicitud recibida correctamente en el repositorio.
fr_fr: Demande reçue avec succès dans le dépôt.
pt_br: Requisição recebida com sucesso no repositório.

# ME00000027 RequestSuccessfullyReceivedIntegrator
source: Request successfully received at the integrator.
es_es: Solicitud recibida correctamente en el integrador.
fr_fr: Demande reçue avec succès auprès de l'intégrateur.
pt_br: Requisição recebida com sucesso no integrador.

# ME00000028 NotChanged
source: Unable to make the change.
es_es: No se puede realizar el cambio.
fr_fr: Impossible d'effectuer le changement.
pt_br: Não é possível fazer a alteração.

# ME00000029 NotSent
source: Unable to send.
es_es: No se puede enviar.
fr_fr: Impossible d'envoyer.
pt_br: Não é possível enviar.

# ME00000030 NotExcluded
source: Unable to delete.
es_es: No se puede eliminar.
fr_fr: Impossible de supprimer.
pt_br: Não é possível excluir.

# ME00000031 Processing
source: The request is being processed, please try again later.
es_es: La solicitud está siendo procesada, por favor, intente nuevamente más tarde.
fr_fr: La demande est en cours de traitement, veuillez réessayer ultérieurement.
pt_br: A requisição está sendo processada, por favor, tente novamente mais tarde.

# ME00000032 MaxValueCharacters
source: The maximum allowed value is {0} characters.
es_es: El valor máximo permitido es de {0} caracteres.
fr_fr: La valeur maximale autorisée est de {0} caractères.
pt_br: O valor máximo permitido é de {0} caracteres.

# ME00000033 MinorFinalDate
source: End date cannot be less than the start date.
es_es: La fecha de finalización no puede ser anterior a la fecha de inicio.
fr_fr: La date de fin ne peut pas être antérieure à la date de début.
pt_br: A data de término não pode ser anterior à data de início.

# ME00000034 BiggerThen
source: Field value must be greater than {0}.
es_es: El valor del campo debe ser mayor que {0}.
fr_fr: La valeur du champ doit être supérieure à {0}.
pt_br: O valor do campo deve ser maior que {0}.

# ME00000035 LessThan
source: The field value must be less than {0}.
es_es: El valor del campo debe ser menor que {0}.
fr_fr: La valeur du champ doit être inférieure à {0}.
pt_br: O valor do campo deve ser menor que {0}.

# ME00000036 BiggerOrEqual
source: The field value must be greater than or equal to {0}.
es_es: El valor del campo debe ser mayor o igual a {0}.
fr_fr: La valeur du champ doit être supérieure ou égale à {0}.
pt_br: O valor do campo deve ser maior ou igual a {0}.

# ME00000037 LessOrEqual
source: The field value must be less than or equal to {0}.
es_es: El valor del campo debe ser menor o igual a {0}.
fr_fr: La valeur du champ doit être inférieure ou égale à {0}.
pt_br: O valor do campo deve ser menor ou igual a {0}.

# ME00000038 DeadlineGreaterThan
source: Deadline greater than {0}.
es_es: Plazo superior a {0}.
fr_fr: Délai supérieur à {0}.
pt_br: Data limite maior que {0}.

# ME00000039 DeadlineLessThan
source: Deadline less than {0}.
es_es: Plazo inferior a {0}.
fr_fr: Délai inférieur à {0}.
pt_br: Data limite menor que {0}.

# ME00000040 DeadlineGreaterOrEqual
source: Deadline greater than or equal to {0}.
es_es: Plazo mayor o igual a {0}.
fr_fr: Délai supérieur ou égal à {0}.
pt_br: Data limite maior ou igual a {0}.

# ME00000041 DeadlineLesserOrEqual
source: Deadline less than or equal to {0}.
es_es: Plazo menor o igual a {0}.
fr_fr: Délai inférieur ou égal à {0}.
pt_br: Data limite menor ou igual a {0}.

# ME00000042 UploadedFileMustBeOfType
source: The uploaded file must be of type {0}.
es_es: El archivo subido debe ser de tipo {0}.
fr_fr: Le fichier téléchargé doit être du type {0}.
pt_br: O arquivo enviado deve ser do tipo {0}.

# ME00000043 NotGuid
source: The value informed in the field is not of type Guid.
es_es: El valor ingresado en el campo no es del tipo Guid.
fr_fr: La valeur indiquée dans le champ n'est pas de type Guid.
pt_br: O valor informado no campo não é do tipo Guid.

# ME00000044 NotFound
source: {0} not found.
es_es: {0} no encontrado.
fr_fr: {0} introuvable.
pt_br: {0} não encontrado.

# ME00000045 Exists
source: Already exists.
es_es: Ya existe.
fr_fr: Existe déjà.
pt_br: Já existe.

# ME00000046 Exists
source: {0} already exists.
es_es: {0} ya existe.
fr_fr: {0} existe déjà.
pt_br: {0} já existe.

# ME00000047 NotValid
source: {0} It is not valid.
es_es: {0} no es valido.
fr_fr: {0} n'est pas valide.
pt_br: {0} não é válido.

# ME00000048 NotNull
source: {0} cannot be null.
es_es: {0} no puede ser nulo.
fr_fr: {0} ne peut pas être nul.
pt_br: {0} não pode ser nulo.

# ME00000049 NotNull
source: It cannot be null.
es_es: No puede ser nulo.
fr_fr: Il ne peut pas être nul.
pt_br: Não pode ser nulo.

# MS00000001 MessageSentToQueue
source: Message sent to queue.
es_es: Mensaje enviado a la cola.
fr_fr: Message envoyé à la file d'attente.
pt_br: Mensagem enviada para a fila.
